Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_mjpeg.c
  /*align buffer to 16 bytes boundary, should be kept the same as CAM module*/
  BL_WR_REG(MJPEG_BASE, MJPEG_YY_FRAME_ADDR, (cfg->bufferCamYY & 0xFFFFFFF0));
  BL_WR_REG(MJPEG_BASE, MJPEG_UV_FRAME_ADDR, (cfg->bufferCamUV & 0xFFFFFFF0));
  BL_WR_REG(MJPEG_BASE, MJPEG_YUV_MEM, (cfg->sizeCamUV << 16) + cfg->sizeCamYY);

  /*align buffer to 16 bytes boundary*/
  BL_WR_REG(MJPEG_BASE, MJPEG_JPEG_FRAME_ADDR, (cfg->bufferMjpeg & 0xFFFFFFF0));
  /*align buffer size in unit of 64 bytes */
  BL_WR_REG(MJPEG_BASE, MJPEG_JPEG_STORE_MEMORY, cfg->sizeMjpeg >> 6);

  /* Clear interrupt */
  BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x3F00);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(MJPEG_IRQn, MJPEG_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  Mjpeg packet mode configure
                                                                                *
                                                                                * @param  cfg: Packet configuration
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Packet_Config(MJPEG_Packet_Type *cfg) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_PAKET_CTRL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_PKET_EN, cfg->packetEnable);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_JEND_TO_PEND, cfg->endToTail);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_PKET_BODY_BYTE, cfg->packetBody);
  BL_WR_REG(MJPEG_BASE, MJPEG_PAKET_CTRL, tmpVal);

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_HEADER_BYTE);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_HEAD_BYTE, cfg->frameHead);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_TAIL_EXP, cfg->frameTail);
  BL_WR_REG(MJPEG_BASE, MJPEG_HEADER_BYTE, tmpVal);

  BL_WR_REG(MJPEG_BASE, MJPEG_PAKET_HEAD_TAIL, (cfg->packetTail << 16) + cfg->packetHead);
}

/****************************************************************************/ /**
                                                                                * @brief  Mjpeg set YUYV order, only work in interleave mode
                                                                                *
                                                                                * @param  y0: Y0 order
                                                                                * @param  u0: U0 order
                                                                                * @param  y1: Y1 order
                                                                                * @param  v0: V0 order
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Set_YUYV_Order_Interleave(uint8_t y0, uint8_t u0, uint8_t y1, uint8_t v0) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_Y0_ORDER, y0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_U0_ORDER, u0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_Y1_ORDER, y1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_V0_ORDER, v0);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_1, tmpVal);

  MJPEG_Set_YUYV_Order_Planar(0, 1);
}

/****************************************************************************/ /**
                                                                                * @brief  Mjpeg set YY/UV order, only work in planar mode
                                                                                *
                                                                                * @param  yy: YY order
                                                                                * @param  uv: UV order
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Set_YUYV_Order_Planar(uint8_t yy, uint8_t uv) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_2);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_YY_DVP2AHB_LSEL, yy);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_YY_DVP2AHB_FSEL, yy);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_UV_DVP2AHB_LSEL, uv);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_UV_DVP2AHB_FSEL, uv);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Deinit mjpeg module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Deinit(void) {
  // GLB_AHB_Slave2_Reset(BL_AHB_SLAVE2_MJPEG);
}

/****************************************************************************/ /**
                                                                                * @brief  Enable mjpeg module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Enable(void) {
  uint32_t tmpVal;

