Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_mjpeg.c
  /* Enable mjpeg module */
  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_1);
  tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_MJPEG_ENABLE);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_1, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Disable mjpeg module
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Disable(void) {
  uint32_t tmpVal;

  /* Disable mjpeg module */
  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_1);
  tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_MJPEG_ENABLE);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_1, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Enable&disable mjpeg software mode and set frame count
                                                                                *
                                                                                * @param  count: Frame count
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_SW_Enable(uint8_t count) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_2);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_SW_FRAME, count);
  tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_MODE);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
  tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_MODE);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  MJPEG software mode run, software mode enable first
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_SW_Run(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_2);
  tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_RUN);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
  tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_MJPEG_SW_RUN);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Get one mjpeg frame
                                                                                *
                                                                                * @param  info: Mjpeg frame infomation pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Get_Frame_Info(MJPEG_Frame_Info *info) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3);

  info->validFrames   = BL_GET_REG_BITS_VAL(tmpVal, MJPEG_FRAME_VALID_CNT);
  info->curFrameAddr  = BL_RD_REG(MJPEG_BASE, MJPEG_START_ADDR0);
  info->curFrameBytes = (BL_RD_REG(MJPEG_BASE, MJPEG_BIT_CNT0) + 7) >> 3;
  info->curFrameQ     = BL_RD_REG(MJPEG_BASE, MJPEG_Q_MODE0) & 0x3f;
  info->status        = tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  Get available count of frames
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Frames count
                                                                                *
                                                                                *******************************************************************************/
uint8_t MJPEG_Get_Frame_Count(void) { return BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3), MJPEG_FRAME_VALID_CNT); }

/****************************************************************************/ /**
                                                                                * @brief  Pop one mjpeg frame
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Pop_Frame(void) { BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 1); }

/****************************************************************************/ /**
                                                                                * @brief  Free current read memory block
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Current_Block_Clear(void) { BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x2); }

/****************************************************************************/ /**
                                                                                * @brief  Current read memory block index
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Block number
                                                                                *
                                                                                *******************************************************************************/
MJPEG_Swap_Block_Type MJPEG_Get_Current_Block(void) { return BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_READ_SWAP_IDX); }

/****************************************************************************/ /**
                                                                                * @brief  Get block status, full or not full
                                                                                *
                                                                                * @param  block: Block number
                                                                                *
                                                                                * @return Block status
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type MJPEG_Block_Is_Full(MJPEG_Swap_Block_Type block) {
  CHECK_PARAM(IS_MJPEG_SWAP_BLOCK_TYPE(block));

  if (MJPEG_BLOCK_0 == block) {
    return BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP0_FULL);
  } else {
    return BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP1_FULL);
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Current read memory block is frame start
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Set or reset
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type MJPEG_Current_Block_Is_Start(void) { return BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP_FSTART); }

/****************************************************************************/ /**
                                                                                * @brief  Current read memory block is frame end
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Set or reset
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type MJPEG_Current_Block_Is_End(void) { return BL_GET_REG_BITS_VAL(BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_MODE), MJPEG_STS_SWAP_FEND); }

/****************************************************************************/ /**
                                                                                * @brief  Get frame remain bit count in last block, only valid when current read memory block is
                                                                                *         frame end
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Bit count
                                                                                *
                                                                                *******************************************************************************/
uint32_t MJPEG_Get_Remain_Bit(void) { return BL_RD_REG(MJPEG_BASE, MJPEG_SWAP_BIT_CNT); }

/****************************************************************************/ /**
                                                                                * @brief  Set frame threshold to issue normal interrupt
                                                                                *
                                                                                * @param  count: Frame threshold
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_Set_Frame_Threshold(uint8_t count) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MJPEG_REG_FRAME_CNT_TRGR_INT, count);
  BL_WR_REG(MJPEG_BASE, MJPEG_CONTROL_3, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  MJPEG Enable Disable Interrupt
                                                                                *
                                                                                * @param  intType: MJPEG Interrupt Type
                                                                                * @param  intMask: Enable or Disable
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void MJPEG_IntMask(MJPEG_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_MJPEG_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  tmpVal = BL_RD_REG(MJPEG_BASE, MJPEG_CONTROL_3);

  switch (intType) {
  case MJPEG_INT_NORMAL:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_NORMAL_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_NORMAL_EN);
    }

    break;

  case MJPEG_INT_CAM_OVERWRITE:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, MJPEG_REG_INT_CAM_EN);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, MJPEG_REG_INT_CAM_EN);
    }

    break;

