Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_mjpeg.c
  if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_NORMAL_INT)) {
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x100);

    if (mjpegIntCbfArra[MJPEG_INT_NORMAL] != NULL) {
      /* call the callback function */
      mjpegIntCbfArra[MJPEG_INT_NORMAL]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_CAM_INT)) {
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x200);

    if (mjpegIntCbfArra[MJPEG_INT_CAM_OVERWRITE] != NULL) {
      /* call the callback function */
      mjpegIntCbfArra[MJPEG_INT_CAM_OVERWRITE]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_MEM_INT)) {
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x400);

    if (mjpegIntCbfArra[MJPEG_INT_MEM_OVERWRITE] != NULL) {
      /* call the callback function */
      mjpegIntCbfArra[MJPEG_INT_MEM_OVERWRITE]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_FRAME_INT)) {
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x800);

    if (mjpegIntCbfArra[MJPEG_INT_FRAME_OVERWRITE] != NULL) {
      /* call the callback function */
      mjpegIntCbfArra[MJPEG_INT_FRAME_OVERWRITE]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_IDLE_INT)) {
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x1000);

    if (mjpegIntCbfArra[MJPEG_INT_BACK_IDLE] != NULL) {
      /* call the callback function */
      mjpegIntCbfArra[MJPEG_INT_BACK_IDLE]();
    }
  }

  if (BL_IS_REG_BIT_SET(tmpVal, MJPEG_STS_SWAP_INT)) {
    BL_WR_REG(MJPEG_BASE, MJPEG_FRAME_FIFO_POP, 0x2000);

    if (mjpegIntCbfArra[MJPEG_INT_SWAP] != NULL) {
      /* call the callback function */
      mjpegIntCbfArra[MJPEG_INT_SWAP]();
    }
  }
}
#endif

/*@} end of group MJPEG_Public_Functions */

/*@} end of group MJPEG */

/*@} end of group BL702_Peripheral_Driver */
